backend/src/test/stress/ws-test-debug.yml
config:
  target: "http://localhost:4000"
  engines:
    socketio: {}
  processor: "./ws-test.processor.cjs"
  phases:
    - duration: 5
      arrivalRate: 5
      name: "debug"

scenarios:
  - name: "debug"
    beforeScenario: login
    engine: "socketio"
    socketio:
      transports:
        - websocket
      query:
        token: "{{ token }}"
        identity: "{{ identity }}"
    flow:
      - emit:
          channel: "joinChannel"
          data: "{{ channelId }}"
      - emit:
          channel: "message"
          data:
            channel: "{{ channelId }}"
            sender: "{{ userId }}"
            text: "debug message"
      - emit:
          channel: "leaveChannel"
          data: "{{ channelId }}"